Repository: NiryoRobotics/pyniryo2
Catalog: docs/locale/*/LC_MESSAGES/source/setup/installation.po
Languages: fr

source: The library uses `Python <https://www.python.org/>`_, which must be installed and available in your working environment
fr: La librairie utilise `Python <https://www.python.org/>`_, qui doit être installé et doit être disponible dans votre environnement de travail

source: The version should be **equal or above** :
fr: La verson doit être **égale ou supérieure à :**

source: 2.7 if you are using Python 2
fr: 2.7 si vous utilisez Python 2

source: 3.6 if you are using Python 3
fr: 3.6 si vous utilisez Python 3

source: To check your Python version, use the command ``python --version`` if you are using Python 2 and ``python3 --version`` if you are using Python3
fr: Pour vérifier votre version de Python, utilisez la commande ``python --version`` si vous utilisez Python 2 et ``python3 --version`` si vous utilisez Python 3

source: The below sections explain how to install the library with **pip**, the package installer for Python
fr: Les sections ci-dessous expliquent comment intaller la librairie avec **pip**, l'installeur de packages de Python

source: If you have both Python 2 & Python 3 installed on your computer, the command ``pip`` will install packages in Python 2 version. You should use ``pip3`` instead in order to to target Python 3
fr: Si vous avez à la fois Python 2 & Python 3 installés sur votre ordinateur, la commande ``pip`` installera les packages en version Python 2. Vous devrez utiliser ``pip3`` à la place pour cibler Python 3

source: Installation with pip
fr: Installation avec pip

source: You need to have installed Numpy package beforehand : ::
fr: Vous devez avoir installé le package Numpy en amont: ::

source: To install Ned's Python package via ``pip``, simply execute::
fr: Pour installer le package Python du Ned avec ``pip``, exécutez simplement::

source: You can find more information about the PyPi package `here <https://pypi.org/project/pyniryo2/>`_
fr: Vous pouvez trouver plus d'informations à propos du package Pypi `ici <https://pypi.org/project/pyniryo2/>`_

source: Uninstall
fr: Désinstaller

source: To uninstall the library use ::
fr: Pour désinstaller la librairie, utilisez ::
