Repository: NiryoRobotics/pyniryo2
Catalog: docs/locale/*/LC_MESSAGES/source/setup/ip_address.po
Languages: fr

source: Find your Robot's IP address
fr: Trouver l'adresse IP de votre Robot

source: In order to use your robot through TCP connection, you will firstly need to connect to it, which imply that you know its IP Address
fr: Pour se connecter à un robot via une connexion TCP, vous devez d'abord vous connecter au robot, ce qui implique de connaître son adresse IP

source: The next sections explain how to find your robot IP according to your configuration:
fr: La prochaine section expique comment trouver l'adresse IP de votre robot en fonction de votre configuration

source: Hotspot mode
fr: Mode Hotspot

source: If you are directly connected to your robot through its wifi, the IP Address you will need to use is ``10.10.10.10``
fr: Si vous êtes directement connecté sur la wifi du robot, l'Adresse IP que vous devrez utiliser est ``10.10.10.10``

source: Simulation or directly on the robot
fr: En simulation ou directement sur le robot

source: In this situation, the Robot is running on the same computer as the client, the IP Address will be the localhost address ``127.0.0.1``
fr: Dans cette situation, le robot tourne sur le même ordinateur que le client. L'Adresse IP sera l'adresse localhost ``127.0.0.1``

source: Direct Ethernet connection
fr: Connexion Ethernet Directe

source: If you are directly connected to your robot with an ethernet cable, the static IP of your robot will be ``169.254.200.200``
fr: Si vous êtes directement connecté au robot avec un câble ethernet, l'IP statique de votre robot sera ``169.254.200.200``

source: The reader should note that he may has to change his wired settings to allow the connection. See how |link_ethernet|_
fr: Le lecteur devrait prendre en considération le fait qu'il doit changer sa configuration de câblage pour permettre la connexion. Voir comment |link_ethernet|_

source: Computer and Robot Connected on the same router
fr: Ordinateur et Robot sont connectés sur le même routeur

source: You will need to find the robot address using ``nmap``, or you can also use search button of Niryo Studio to see which robots are available
fr: Vous aurez besoin de trouver l'adresse du robot en utilisant ``nmap``, ou vous pouvez également utiliser le bouton de recherche de Niryo Studio pour voir quels robots sont disponibles

source: You can also :ref:`make the IP permanent <source/setup/ip_address:Make IP permanent>` so that you won't have to search for it next time
fr: Vous pouvez également :ref:`rendre l'adresse IP permanente <source/setup/ip_address:Make IP permanent>` pour ne pas à avoir à le rechercher la prochaine fois

source: Make IP permanent
fr: Rendre l'IP permanente

source: Step 1
fr: Etape 1

source: Firstly, you need to be connected to your robot via SSH.
fr: Dans un premier temps, vous devez être connecté au robot en SSH

source: On Ubuntu, use the command line ::
fr: Sur Ubuntu, utilisez la ligne de commande

source: The password is ``robotics``
fr: Le mot de passe est ``robotics``

source: On Windows, you can use `Putty <https://www.putty.org/>`_. Robot username is ``niyro`` and password is ``robotics``
fr: Sur Windows, vous pouvez utilisez `Putty <https://www.putty.org/>`_. L'identifiant est ``niyro`` et le mot de passe est ``robotics``

source: Step 2
fr: Etape 2

source: Find your proxy key ::
fr: Trouvez votre clé proxy

source: Your proxy key is written on the first line and should look something like ``eth0``.
fr: Votre clé poxy est écrite sur la première ligne et devrait ressembler à quelque chose comme ``eth0``.

source: Step 3
fr: Etape 3

source: Select arbitrarily a number between 50 & 255. It will be your IP address' last number
fr: Selectionne arbitrairement un nombre entre 50 et 255. Ce sera le dernier nombre de votre adresse IP

source: Then, edit the file ``/etc/network/interfaces`` ::
fr: Ensuite, éditez le fichier ``/etc/network/interfaces`` ::

source: And add to its end ::
fr: Et ajoutez à la fin ::

source: From its next reboot, the robot will appear under the IP ``192.168.1.<your_ip_address_last_number>``
fr: A partir du prochain reboot, le robot apparaitra sous l'adresse IP ``192.168.1.<dernier_nombre_adresse_ip>``
