Repository: NiryoRobotics/pyniryo2
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: fr

source: Setup
fr: Installation

source: Examples
fr: Exemples

source: API Documentation
fr: Documentation API

source: PyNiryo2 Documentation
fr: Documentation PyNiryo2

source: This documentation presents Ned's PyPi package, which is the second version of the python API Pyniryo for the robots: Niryo One, Ned and Ned2. It is based on the roslibpy library and allows a more complete programming of the robots.
fr: Cette documentation présente le paquet PyPi de Ned, qui est la deuxième version de l'API python Pyniryo pour les robots : Niryo One, Ned et Ned2. Il est basé sur la bibliothèque roslibpy et permet une programmation plus complète des robots.

source: It offers a simple way for developers to create programs for robot and to control them via remote communication from their computers. Contrary to the Python ROS Wrapper, the user will not need to be connected on the robot through a terminal. This API is based on `roslibpy <https://roslibpy.readthedocs.io/en/latest/index.html>`_.
fr: Cette API permet aux développeurs de créer des programmes robotiques facilement et de contrôler les robots en communiquant à distance par le biais de leurs ordinateurs. Contrairement au Wrapper ROS Python, l'utilisateur ne nécessitera pas d'être connecté au robot par le biais d'un terminal. Cette API est basée sur `roslibpy <https://roslibpy.readthedocs.io/en/latest/index.html>`_.

source: This package is able to control Ned in simulation as well as the physical robot.
fr: Ce package est capable de contrôler le Ned physique mais également en simulation.

source: Functionality
fr: Fonctionnalité

source: Robot control
fr: Contrôle du robot

source: **YES**
fr: **Oui**

source: Callbacks functions
fr: Fonctions de callbacks

source: **NO**
fr: **Non**

source: Parallelism of commands
fr: Parallélisme de commandes

source: Asynchronous functions
fr: Fonctions asynchrones

source: Before getting started
fr: Avant de commencer

source: If you haven’t already done so , make sure to learn about the ROS robot software by reading the |ros_doc|_.
fr: Si vous ne l'avez pas déjà fait, familiarisez vous avec le logiciel ROS du robot en lisant la |ros_doc|_.

source: This documentation also contains everything you need to know if you want to use Ned through simulation.
fr: Cette documentation contient également tout ce que vous devez savoir si vous souhaitez utiliser Ned en simulation.

source: Sections organization
fr: Organisation des sections

source: This document is organized in 4 main sections
fr: Ce document est organisé en quatre sections principales.

source: Install & Setup your environment in order to use Ned with PyNiryo2.
fr: Installez et mettez en place votre environnement afin d'utiliser Ned avec Pyniryo2.

source: Firstly, follow :doc:`Installation instructions <source/setup/installation>`, then :doc:`find your Robot IP address <source/setup/ip_address>` to be ready.
fr: Dans un premier temps, suivez les :doc:`Instructions d'installation <source/setup/installation>`, puis :doc:`Trouver l'adresse IP du robot<source/setup/ip_address>` pour être prêt.

source: Learn how to use the PyNiryo2 package to implement various tasks
fr: Apprenez comment utiliser le package PyNiryo2 afin d'implémenter diverses tâches.

source: Master controls with PyNiryo2 with full detailed functions :doc:`here <source/api_doc/niryo_robot>`
fr: Le master est contrôlé par PyNiryo2 via les fonctions détaillées :doc:`ici <source/api_doc/niryo_robot>`.

source: Indices and tables
fr: Indexes et tableaux
