Repository: NiryoRobotics/pyniryo2
Catalog: docs/locale/*/LC_MESSAGES/source/api_doc/arm.po
Languages: fr

source: Arm
fr: Bras

source: This file presents the different :ref:`source/api_doc/arm:Arm - Command functions`, :ref:`source/api_doc/arm:Arm - Enums`, :ref:`source/api_doc/arm:Arm - Niryo Topics` & :ref:`source/api_doc/arm:Arm - Objects` available with the Arm API
fr: Ce fichier présente les différentes :ref:`source/api_doc/arm:Arm - Command functions`, :ref:`source/api_doc/arm:Arm - Enums`, :ref:`source/api_doc/arm:Arm - Niryo Topics` & :ref:`source/api_doc/arm:Arm - Objects` disponible avec l'API du Bras

source: Arm - Command functions
fr: Bras - Fonctions de contrôle

source: This section reference all existing functions to control your robot arm, which include
fr: Cette section fait reference à toutes les fonctions de contrôle du bras existantes, ce qui inclut

source: Getting the robot state
fr: Obtenir l'état du robot

source: Moving the arm
fr: Bouger le bras

source: Getting inverse and forward kinematics
fr: Obtenir la cinématique inverse et directe

source: Calibrating the robot
fr: Calibrer le robot

source: All functions to control the robot are accessible via an instance of the class :ref:`source/api_doc/niryo_robot:NiryoRobot` ::
fr: Toutes les fonctions de contôle du bras sont accessibles grâce à une instance de la classe :ref:`source/api_doc/niryo_robot:NiryoRobot` ::

source: See examples on :ref:`Examples Section <source/examples/examples_basics:Examples: Basics>`
fr: Voir des exemples dans la :ref:`Section Exemples <source/examples/examples_basics:Examples: Basics>`

source: List of functions subsections:
fr: Liste des sous-sections des fonctions :

source: Arm robot functions
fr: Fonction du robot

source: Example: ::
fr: Exemples: ::

source: Parameters
fr: Paramètres

source: Niryo ROS client
fr: Client Niryo ROS

source: Calibration functions
fr: Fonctions de calibration

source: Calibrates (manually or automatically) motors. Automatic calibration will do nothing if motors are already calibrated
fr: Calibre (manuellement ou automatiquement) les moteurs. La calibration automatique n'aura pas d'effet si les moteurs sont déjà calibrés

source: Examples: ::
fr: Exemples: ::

source: Auto or Manual
fr: Automatique ou Manuel

source: Callback invoked on successful execution.
fr: Fonction de rappel lancée en cas de réussite lors de l'exécution

source: Callback invoked on error.
fr: Fonction de rappel lancée en cas d'erreur lors de l'exécution

source: Timeout for the operation, in seconds. Only used if blocking.
fr: Délai d'exécution de l'opération, en secondes. Utilisé seulement en cas de blocage

source: Return type
fr: Type Retour

source: Starts a automatic motors calibration if motors are not calibrated yet.
fr: Démarre une calibration automatique des moteurs s'ils ne sont pas déjà calibrés.

source: Starts a automatic motors calibration even if motors are calibrated yet.
fr: Démarre une calibration automatique des moteurs même s'ils sont déjà calibrés.

source: Resets current calibration status. A new calibration is then necessary.
fr: Réinitialise le status de la calibration courante. Une nouvelle calibration est alors nécessaire.

source: Timeout for the operation, in seconds.
fr: Délai d'exécution de l'opération, en secondes.

source: Returns a bool indicating whereas the robot motors need to be calibrate.
fr: Retourne un booléen indiquant si les moteurs doivent être calibrés

source: Returns
fr: Retourne

source: True if calibration is needed, False otherwise.
fr: Vrai si la calibration est nécessaire, Faux le cas contraire

source: Robot move functions
fr: Fonction de mouvement du robot

source: Limit arm max velocity to a percentage of its maximum velocity
fr: Limiter la vitesse maximum du bras à un pourcentage de sa vitesse maximum

source: Should be between 1 & 100
fr: Doit être entre 1 et 100

source: Go to home pose and activate learning mode
fr: Bouge le bras jusqu'a la position home et active le mode d'apprentissage

source: Stop a current execution of move_pose, move_joint or move_linear_pose. The robot will stop at its current position . If a callback function is not passed in parameter, the function will be blocking. Otherwise, the callback will be called when the execution of the function is finished.
fr: Arrête l'exécution du mouvement actuel de move_pose, move_joint ou de move_linear_pose. Le robot va s'arrêter à sa position actuelle. Si une fonction de retour n'est pas passée en paramètre, la fonction sera bloquante. Sinon la fonction de retour sera appelée quand l'exécution de la fonction sera terminée.

source: Move to a position where the forearm lays on shoulder If a callback function is not passed in parameter, the function will be blocking. Otherwise, the callback will be called when the execution of the function is finished.
fr: Bouge le robot à une position dans laquelle l’avant bras du robot repose sur son épaule. Si une fonction de retour n'est pas passée en paramètre, la fonction sera bloquante. Sinon la fonction de retour sera appelée quand l'exécution de la fonction sera terminée.

source: Move robot joints. Joints are expressed in radians. If a callback function is not passed in parameter, the function will be blocking. Otherwise, the callback will be called when the execution of the function is finished.
fr: Réalise une action de mouvement d’axes. Les axes sont exprimés en radian. Réalise une action de déplacement de l’effecteur par glissement.

source: All lines of the next example realize the same operation: ::
fr: Toutes les lignes de l'exemple suivant réalisent la même action: ::

source: a list of 6 joints
fr: Liste des noms des axes

source: Move robot end effector pose to a (x, y, z, roll, pitch, yaw) pose in the frame (frame_name) if defined. x, y & z are expressed in meters / roll, pitch & yaw are expressed in radians If a callback function is not passed in parameter, the function will be blocking. Otherwise, the callback will be called when the execution of the function is finished.
fr: Déplace l’effecteur à la position [x, y, z, roll, pitch, yaw], dans un repère particulier si précisé. x, y, z sont exprimés en mètres / roll, pitch & yaw sont exprimés en radian. Si une fonction de retour n'est pas passée en paramètre, la fonction sera bloquante. Sinon la fonction de retour sera appelée quand l'exécution de la fonction sera terminée.

source: either a list of 6 coordinates or a ``PoseObject``
fr: soit 6 arguments (1 pour chaque coordonnées) ou une liste de 6 coordonnées ou un ``PoseObject``

source: name of the frame
fr: nom du repère

source: Move robot end effector pose to a (x, y, z, roll, pitch, yaw) pose in a linear way, in the frame (frame_name) if defined. If a callback function is not passed in parameter, the function will be blocking. Otherwise, the callback will be called when the execution of the function is finished.
fr: Déplace l’effecteur à la position [x, y, z, roll, pitch, yaw], d'une manière linéaire, dans un repère particulier si précisé. x, y, z sont exprimés en mètres / roll, pitch & yaw sont exprimés en radian. Si une fonction de retour n'est pas passée en paramètre, la fonction sera bloquante. Sinon la fonction de retour sera appelée quand l'exécution de la fonction sera terminée.

source: either or a list of 6 coordinates or a PoseObject
fr: soit 6 arguments (1 pour chaque coordonnées) ou une liste de 6 coordonnées ou un ``PoseObject``

source: Shift robot end effector pose along one axis If a callback function is not passed in parameter, the function will be blocking. Otherwise, the callback will be called when the execution of the function is finished.
fr: Réalise une action de déplacement de l’effecteur par glissement. Réalise une action de déplacement de l’effecteur par glissement.

source: Axis along which the robot is shifted
fr: Valeur de l’énumérations correspondant à l’axe de glissement

source: In meter for X/Y/Z and radians for roll/pitch/yaw
fr: En mètre pour X, Y, Z et en radian pour roll, pitch, yaw

source: Move robot end of a offset in a frame
fr: Déplace l'effecteur d'un offset dans un repère

source: name of local frame
fr: nom du repère

source: list which contains offset of x, y, z, roll, pitch, yaw
fr: la liste qui contient les paramètres x, y, z, roulis, tangage et lacet

source: Move robot end of a offset by a linear movement in a frame
fr: Déplace l'effecteur d'un offset dans un repère de manière linéaire

source: Set jog control mode if param is True, else turn it off
fr: Active le mode de contrôle direct si le paramètre est ``Vrai``, l'éteint le cas contraire

source: ``True`` or ``False``
fr: ``Vrai`` ou ``Faux``

source: Jog robot joints'. Jog corresponds to a shift without motion planning. Values are expressed in radians. If a callback function is not passed in parameter, the function will be blocking. Otherwise, the callback will be called when the execution of the function is finished.
fr: Réalise un control direct sur la position des axes. Les valeurs sont exprimées en radians. Si une fonction de retour n'est pas passée en paramètre, la fonction sera bloquante. Sinon la fonction de retour sera appelée quand l'exécution de la fonction sera terminée.

source: a list of 6 joints offset
fr: la liste des 6 offset des axes

source: Jog robot end effector pose Jog corresponds to a shift without motion planning Arguments are [dx, dy, dz, d_roll, d_pitch, d_yaw] dx, dy & dz are expressed in meters / d_roll, d_pitch & d_yaw are expressed in radians If a callback function is not passed in parameter, the function will be blocking. Otherwise, the callback will be called when the execution of the function is finished.
fr: Réalise un control direct sur l'effecteur. Les arguments sont [dx, dy, dz, d_roll, d_pitch, d_yaw], dx, dy, dz sont exprimés en mètres / d_roll, d_pitch, d_yaw sont exprimés en radians. Si une fonction de retour n'est pas passée en paramètre, la fonction sera bloquante. Sinon la fonction de retour sera appelée quand l'exécution de la fonction sera terminée.

source: a list of 6 offset
fr: la liste des 6 offset

source: Robot status functions
fr: Fonction de statut du robot

source: Returns the hardware state client which can be used synchronously or asynchronously to obtain the hardware state.
fr: Retourne le client de l'état hardware qui peut être utilisé de manière synchrone ou asynchrone pour obtenir l'état hardware

source: hardware state topic instance
fr: Instance de topic d'état hardware

source: Get the joints state topic which can be used synchronously or asynchronously to obtain the joints state. The joints state topic returns a JointStateObject.
fr: Obtient le topic d'état des joints qui peut être utilisé de manière synchrone ou asynchrone pour obtenir l'état des joints. Le topic d'état des joints retourne un JointStateObject

source: It can be used as follows:: ::
fr: Cela peut être utilisé comme ceci:: ::

source: Joint states topic.
fr: Topic de l'état des joints

source: Get joints value in radians You can also use a getter ::
fr: Obtient la valeur des axes en radians. Vous pouvez également utiliser un getter

source: List of joints value
fr: Liste des valeurs des axes

source: Get joints value in radians
fr: Obtient la valeur des axes en radians.

source: Get end effector link pose as [x, y, z, roll, pitch, yaw]. x, y & z are expressed in meters / roll, pitch & yaw are expressed in radians
fr: Obtient la position de l'effecteur sous la forme [x, y, z, roll, pitch, yaw]. x, y & z sont exprimés en mètres / roll, pitch & yaw sont exprimés en radians

source: You can also use a getter ::
fr: Il est également possible d'utiliser un getter ::

source: end effector link pose
fr: Position de l'effecteur

source: Get the end effector link pose topic which can be used synchronously or asynchronously to obtain the end effector link pose. The joints state topic returns a PoseObject. x, y & z are expressed in meters / roll, pitch & yaw are expressed in radians
fr: Obtient le topic de la postion de l'effecteur qui peut être utilisé de manière synchrone ou asynchrone pour obtenir la position de l'effecteur. Le topic de l'état des axes retourne un PoseObject. x, y & z sont exprimés en mètres / roll, pitch & yaw sont exprimés en radians

source: See below some usage ::
fr: Voir ci-dessous quelques utilisations

source: end effector link pose topic
fr: Topic de position de l'effecteur

source: Get end effector link pose in Quaternion coordinates
fr: Obtient la positon de l'effecteur en coordonnées quaternion

source: Position and quaternion coordinates concatenated in a list : [x, y, z, qx, qy, qz, qw]
fr: Positions et coordonnées quaternion concaténées dans une liste [x, y, z, qx, qy, qz, qw]

source: Learning mode functions
fr: Fonctions du mode apprentissage

source: Returns the learning mode client which can be used synchronously or asynchronously to obtain the learning mode state. The learning mode client returns a boolean value.
fr: Retourne le client du mode apprentissage qui peut être utilisé de manière synchrone ou asynchrone pour obtenir l'état du mode apprentissage. Le client du mode apprentissage retourne une valeur booléene

source: learning mode state topic instance
fr: Instance du topic du mode apprentissage

source: Get learning mode state.
fr: Obtient l'état du mode apprentissage

source: ``True`` if learning mode is on
fr: ``Vrai`` si le mode apprentissage est activé

source: Set learning mode if param is ``True``, else turn it off
fr: Active le mode apprentissage si le paramètre est ``Vrai``, l'éteint le cas contraire

source: Kinematics functions
fr: Fonctions cinématiques

source: Compute forward kinematics of a given joints configuration and give the associated spatial pose
fr: Cacule la cinématique directe pour une configuration d'axes donnée et donne la position spatiale associé

source: either 6 args (1 for each joints) or a list of 6 joints
fr: soit 6 arguments (1 pour chaque axe) ou une liste de 6 axes

source: Compute inverse kinematics
fr: Calcule la cinématique inverse

source: either 6 args (1 for each coordinates) or a list of 6 coordinates or a ``PoseObject``
fr: soit 6 arguments (1 pour chaque coordonnées) ou une liste de 6 coordonnées ou un ``PoseObject``

source: Arm - Niryo Topics
fr: Bras - Topics Niryo

source: The use of these functions is explained in the :ref:`source/api_doc/niryo_topics:NiryoTopic` section. They allow the acquisition of data in real time by callbacks or by direct call.
fr: L'utilisation de ces fonctions est expliquée dans la section :ref:`source/api_doc/niryo_topics:NiryoTopic`. Elles permettent l'acquisition de données en temps réel par des fonctions de rappel ou des appels directs.

source: Arm's Niryo Topics
fr: Topics du bras Niryo

source: Name
fr: Nom

source: Function
fr: Fonctions

source: Arm - Enums
fr: Bras - Enumerations

source: List of enums:
fr: Liste d'enumerations

source: Enumeration of Calibration Modes
fr: Enumerations des modes de calibration

source: Enumeration of Robot Axis : it used for Shift command
fr: Enumeration des axes du robot : utilsé pour les commandes par glissement

source: Enumeration of Jog Shift : it used for Jog commands
fr: Enumeration des translations : utilisée pour les commandes par translations

source: Arm - Objects
fr: Bras - Objets

source: Object used to store every hardware information
fr: Objet utilisé pour sauvegarder toute les informations hardware

source: Variables
fr: Attributs

source: Number representing the rpi temperature
fr: Nombre représentant la température de la raspberry

source: Number representing the hardware version
fr: Nombre représentant la version du matériel

source: Boolean indicating if the connection with the robot is up
fr: Booléen indicant si la connection avec le robot est faite

source: Error message status on error
fr: Message du status d'erreur

source: Boolean indicating if a calibration is needed
fr: Booléen

source: Boolean indicating if calibration is in progress
fr: Booléen indicant une la calibration est en cours

source: List of motor names
fr: Liste des noms des moteurs

source: List of motor types
fr: Liste des types de moteurs

source: List of motors_temperature
fr: Liste de la température des moteurs en degrés celsius

source: List of motors_voltage
fr: Liste de la tension des moteurs en volt

source: List of hardware errors
fr: Liste des codes erreurs moteur

source: List of hardware error messages
fr: Liste des textes d'erreurs moteurs

source: Object used to store every joint state information
fr: Objet utilisé pour sauvegarder toute les informations des axes

source: List of joint names
fr: Liste des noms des axes

source: List of joint positions
fr: Liste des positions des axes

source: List of joint velocities
fr: Liste des vitesses des axes

source: List of joint efforts
fr: Liste des effors des axes

source: Pose object which stores x, y, z, roll, pitch & yaw parameters
fr: Objet Pose qui contient les paramètres x, y, z, roulis, tangage et lacet.

source: X (meter)
fr: X (mètres)

source: Y (meter)
fr: Y (mètres)

source: Z (meter)
fr: Z (mètres)

source: Roll (radian)
fr: Roulis (radian)

source: Pitch (radian)
fr: Tangage (radian)

source: Yaw (radian)
fr: Lacet (radian)
