Repository: NiryoRobotics/pyniryo2
Catalog: docs/locale/*/LC_MESSAGES/source/api_doc/conveyor.po
Languages: fr

source: Conveyor
fr: Convoyeur

source: This file presents the different :ref:`source/api_doc/conveyor:Conveyor - Command functions`, :ref:`source/api_doc/conveyor:Conveyor - Enums`, :ref:`source/api_doc/conveyor:Conveyor - Niryo Topics` & :ref:`source/api_doc/conveyor:Conveyor - Namedtuple` available with the Arm API
fr: Ce fichier présente les différentes :ref:`source/api_doc/conveyor:Conveyor - Command functions`, :ref:`source/api_doc/conveyor:Conveyor - Enums`, :ref:`source/api_doc/conveyor:Conveyor - Niryo Topics` & :ref:`source/api_doc/conveyor:Conveyor - Namedtuple` disponible avec l'API du Bras

source: Conveyor - Command functions
fr: Fonctions du convoyeur

source: This section reference all existing functions to control your robot, which include
fr: Cette section fait référence à toutes les fonctions de contrôle du robot, ce qui inclut

source: Controlling conveyors
fr: Contrôle les convoyeurs

source: All functions to control the robot are accessible via an instance of the class :ref:`source/api_doc/niryo_robot:NiryoRobot` ::
fr: Toutes les fonctions de contrôle du robot sont accessiblent grâce à une instance class :ref:`source/api_doc/niryo_robot:NiryoRobot` ::

source: See examples on :ref:`Examples Section <source/examples/examples_conveyor:Examples: Conveyor>`
fr: Voir des exemples sur :ref:`Examples Section <source/examples/examples_conveyor:Examples: Conveyor>`

source: List of functions subsections:
fr: List des fonctions des sous-sections

source: Conveyor functions
fr: Fonctions du convoyeur

source: Conveyor robot functions
fr: Fonctions du convoyeur

source: Example: ::
fr: Exemple: ::

source: Parameters
fr: Paramètres

source: Niryo ROS client
fr: Client Niryo ROS

source: Scan if a conveyor is plugged or not on a can bus. If a new conveyor is detected, activate it and return its conveyor ID. If a conveyor is already set, return its ID
fr: Vérifie que le convoyeur est branché ou qu'il n'est pas sur un bus CAN. Si un nouveau convoyeur est detecté, il l'active et retourne son identifiant. Si le convoyeur est déjà installé, il retourne son identifiant

source: :return : New conveyor ID :rtype: ConveyorID
fr: :return : Identifiant du Nouveau Convoyeur :rtype: ConveyorID

source: Remove and unset a conveyor previously plugged and set
fr: Retire ou désactive un convoyeur déjà branché et installé

source: Basically, ConveyorID.ID_1 or ConveyorID.ID_2
fr: Simplement, ConveyorID.ID_1 ou ConveyorID.ID_2

source: Return type
fr: Type de la variable de Retour

source: Run conveyor at id 'conveyor_id'
fr: Activer le convoyeur avec l'id 'conveyor_id'

source: The conveyor id
fr: L'identifiant du convoyeur

source: speed percentage between 0% and 100%
fr: Pourcentage de vitesse entre 0% et 100%

source: Stop conveyor at id 'conveyor_id'
fr: Stoppe le convoyeur ayant l'identifiant 'conveyor_id'

source: Control conveyor associated to conveyor_id. Then stops it if bool_control_on is False, else refreshes it speed and direction
fr: Contrôle le convoyeur associé au conveyor_id. Puis s'arrête si bool_control_on est à Fau

source: # Example 2
fr: # Exemple 2

source: # Set the conveyor and get its id, control it and then stop it after 3 seconds # It this second example, we control the conveyor at a speed of 30% and in the backward direction
fr: # équipe le convoyeur et obtenir son identifiant, le contrôle et l'arrête après 3 secondes. # Dans ce deuxième exemple, nous contrôlons le convoyeur à une vitesse de 30% et dans le sens inverse.

source: True for activate, False for deactivate
fr: Vrai pour activer, Faux pour désactiver

source: New speed which is a percentage of maximum speed (0% to 100%)
fr: Nouvelle vitesse qui est un Pourcentage de la vitesse maximale (de 0% à 100%)

source: Returns the conveyors feedback client which can be used synchronously or asynchronously to obtain the conveyors feedback: (conveyor_id, connection_state, running, speed, direction)
fr: Retourne le client de rétroaction des convoyeurs qui peut être utilisé de manière synchrone ou asynchrone pour obtenir les retours d'information des convoyeurs: (conveyor_id, connection_state, running, speed, direction)

source: Examples: ::
fr: Exemples: ::

source: Returns
fr: Retourne

source: Return list of registered conveyors
fr: Retourne la liste des convoyeurs enregistrés

source: Conveyor - Niryo Topics
fr: Convoyeur - Topics Niryo

source: The use of these functions is explained in the :ref:`source/api_doc/niryo_topics:NiryoTopic` section. They allow the acquisition of data in real time by callbacks or by direct call.
fr: L'utilisation des ces fonctions est expliquée dans la section :ref:`source/api_doc/niryo_topics:NiryoTopic`. Elles permettent l'acquisition de données en temps réel par des fonctions de rappel ou des appels directs

source: Conveyors's Niryo Topics
fr: Topics des Convoyeurs Niryo

source: Name
fr: Nom

source: Function
fr: Fonction

source: Conveyor - Enums
fr: Convoyeur - Enumerations

source: List of enums:
fr: Liste des enumerations:

source: ConveyorID to be able to have CAN (id 12 and 13) and TTL (id 9 and 10) conveyor in any possible combination
fr: ConveyorID pour être capable de contrôler à la convoyeurs avec une interface TTL (id 9 et 10) et/ou CAN (id 12 et 13)

source: ConveyorID to control conveyors with CAN interface
fr: ConveyorID pour contrôler les convoyeurs avec un interface CAN

source: ConveyorID to control conveyors with TTL interface
fr: ConveyorID pour contrôler les convoyeurs avec un interface TTL

source: Enumeration of the directions of the conveyor
fr: Enumeration des directions du convoyeur

source: Enumeration of the different Conveyor status
fr: Enumeration des différents états du convoyeur

source: Conveyor - Namedtuple
fr: Convoyeur - Namedtuple

source: Create new instance of ConveyorInfo(conveyor_id, running, speed, direction)
fr: Crée une nouvelle instance de ConveyorInfo(conveyor_id, running, speed, direction)

source: Alias for field number 0
fr: Alias pour le champ numéro 0

source: Alias for field number 3
fr: Alias pour le champ numéro 3

source: Alias for field number 1
fr: Alias pour le champ numéro 1

source: Alias for field number 2
fr: Alias pour le champ numéro 2
