Repository: NiryoRobotics/pyniryo2
Catalog: docs/locale/*/LC_MESSAGES/source/api_doc/frames.po
Languages: fr

source: Frames
fr: Repères

source: This file presents the different :ref:`source/api_doc/frames:Frames - Command functions` available with the Frames API
fr: Ce fichier présente les différentes :ref:`source/api_doc/frames:Frames - Command functions` disponible avec l’API du Bras

source: All functions to control the robot are accessible via an instance of the class :ref:`source/api_doc/niryo_robot:NiryoRobot` ::
fr: Toutes les fonctions de contrôle du robot sont accessible grâce à une instance de classe :ref:`source/api_doc/niryo_robot:NiryoRobot` ::

source: Frames - Command functions
fr: Repères : Fonctions de contrôle

source: List of functions subsections:
fr: Liste des sous-sections des fonctions:

source: Frames functions
fr: Fonctions des repères

source: Get list of saved dynamic frames
fr: Obtient la liste des repères dynamiques

source: Example: ::
fr: Exemple: ::

source: Returns
fr: Renvoie

source: list of dynamic frames name, list of description of dynamic frames
fr: la liste des noms des repères dynamiques, la liste des descriptions des repères dynamiques

source: Return type
fr: Type renvoyé

source: Get name, description and pose of a dynamic frame
fr: Obtient le nom, la description et la position d'un repère dynamique

source: Parameters
fr: Paramètres

source: name of the frame
fr: nom du repère

source: name, description, position and orientation of a frame
fr: Obtient le nom, la description et la position d'un repère dynamique

source: Create a dynamic frame with 3 poses (origin, x, y)
fr: Créer un repère dynamiques avec 3 positions (origine, x, y)

source: description of the frame
fr: decription du repère

source: pose of the origin of the frame
fr: position de l'origine du repère

source: pose of the point x of the frame
fr: position du point x du repère

source: pose of the point y of the frame
fr: position du point y du repère

source: indicate if the frame belong to a workspace
fr: indique si le repère appartient à un espace de travail

source: Create a dynamic frame with 3 points (origin, x, y)
fr: Créer un repère dynamique avec 3 points (origine, x, y)

source: origin point of the frame
fr: point d'origine du repère

source: point x of the frame
fr: point x du repère

source: point y of the frame
fr: point y du repère

source: Modify a dynamic frame
fr: Modifie un repère dynamique

source: new name of the frame
fr: nouveau nom du repère

source: new description of the frame
fr: nouvelle description du repère

source: Delete a dynamic frame
fr: Supprime un repère

source: name of the frame to remove
fr: nom du repère à supprimer
