Repository: NiryoRobotics/pyniryo2
Catalog: docs/locale/*/LC_MESSAGES/source/api_doc/io.po
Languages: fr

source: This file presents the different :ref:`source/api_doc/io:I/Os - Command functions`, :ref:`source/api_doc/io:I/Os - Enums`, :ref:`source/api_doc/io:I/Os - Niryo Topics` & :ref:`source/api_doc/io:I/Os - Objects` available with the Arm API
fr: Ce fichier présente les différentes :ref:`source/api_doc/io:I/Os - Command functions`, :ref:`source/api_doc/io:I/Os - Enums`, :ref:`source/api_doc/io:I/Os - Niryo Topics` & :ref:`source/api_doc/io:I/Os - Objects` disponible avec l'API du bras

source: I/Os - Command functions
fr: I/Os - Fonctions de contrôle

source: Decorator that check the robot version
fr: Décorateur qui vérifie la version du robot

source: This section reference all existing functions to control your robot, which include
fr: Cette section répertorie toutes les fonctions de contrôle du robot existantes, ce qui inclut

source: Getting IOs status
fr: Obtient les status des I/Os

source: Setting IOs mode
fr: Paramètre le mode des I/Os

source: Setting IOs value
fr: Paramètre la valeur des I/Os

source: All functions to control the robot are accessible via an instance of the class :ref:`source/api_doc/niryo_robot:NiryoRobot` ::
fr: Toutes les fonctions pour contrôler le robot sont accessible grâce à une instance de la classe :ref:`source/api_doc/niryo_robot:NiryoRobot` ::

source: See examples on :ref:`Examples Section <source/examples/examples_conveyor:Examples: Conveyor>`
fr: Voir des exemples dans la :ref:`Section Exemples <source/examples/examples_conveyor:Examples: Conveyor>`

source: List of functions subsections:
fr: Liste des fonctions de sous-sections

source: IO robot functions
fr: Fonctions des E/S du robot

source: Example: ::
fr: Exemples: ::

source: Parameters
fr: Paramètres

source: Niryo ROS client
fr: Client Niryo ROS

source: State functions
fr: Fonctions des Etats

source: Return the value of digital ios.
fr: Retourne la valeur des E/S digitales.

source: Returns
fr: Retourne

source: State, Name, Mode of the pin
fr: Etat, Nom, Broche, Mode de la broche

source: Return type
fr: Type de retour

source: Returns the io state client which can be used synchronously or asynchronously to obtain the io states. The io state client returns a list of DigitalPinObject.
fr: Retourne le client de l'état de l'io qui peut être utilisé de manière synchrone ou asynchrone pour obtenir les états des ios. Le client de l'état de l'io retourne une liste de DigitalPinObject

source: Examples: ::
fr: Exemples: ::

source: io state topic instance
fr: Instance du topic de l'état de l'io

source: Return the value of a digital io.
fr: Retourne la valeur d'un io numérique

source: digital io object
fr: Objet E/S digitale

source: Read & Write functions
fr: Fonctions de Lecture & Ecriture

source: Set pin_id state to digital_state
fr: Règle l'état de pin_id à digital_state

source: Return the value of a digital pin.
fr: Retourne la valeur d'une E/S digitale

source: I/Os - Niryo Topics
fr: I/Os - Topics Niryo

source: The use of these functions is explained in the :ref:`source/api_doc/niryo_topics:NiryoTopic` section. They allow the acquisition of data in real time by callbacks or by direct call.
fr: L'utilisation de ces fonctions est expliquéd dans la section :ref:`source/api_doc/niryo_topics:NiryoTopic`. Elles permettent la récupération données en temps réel par des fonctions de retour ou des appels directs.

source: I/O's Niryo Topics
fr: Topics Niryo des I/Os

source: Name
fr: Nom

source: Function
fr: Fonction

source: I/Os - Enums
fr: I/Os - Enumerations

source: List of enums:
fr: Liste des enumerations

source: Enumeration of Pin Modes
fr: Enumeration des modes de la broche

source: Pin State is either LOW or HIGH
fr: Etat de la broche est soit BAS ou HAUT

source: Enumeration of Robot Pins
fr: Enumeration des broches du robot

source: I/Os - Objects
fr: I/Os - Objets

source: Object used to store information on digital pins
fr: Objet utilisé pour sauvegarder des informations sur les broches numériques
