Repository: NiryoRobotics/pyniryo2
Catalog: docs/locale/*/LC_MESSAGES/source/api_doc/niryo_topics.po
Languages: fr

source: Pyniryo2 is based on the python library roslibpy to collect information from the robot. This information is sent by ROS via topics. This class is an overlay of the API `roslibpy Topic <https://roslibpy.readthedocs.io/en/latest/reference/index.html#topics>`_. It allows you to subscribe to a topic to collect the information from the topic as soon as it is published, or ask for only one value. Please refer to the Niryo robot ROS doc to see the compatible topics.
fr: Pyniryo2 est basé sur la librairie python roslibpy pour collecter des informations du robot. Ces informations sont transmise par ROS grâce à des topics. Cette classe est une surcouche de l'API `Topic roslibpy <https://roslibpy.readthedocs.io/en/latest/reference/index.html#topics>`_. Cela permet de s'abonner à un topic pour collecter des informations dès qu'elles sont publiées, ou demandées pour une valeur. Merci de vous référer à la documentation ROS du robot Niryo pour voir les topics compatibles.

source: NiryoTopic - Usage
fr: NiryoTopic - Utilisation

source: Represent a Ros Topic instance. It supports both the request of a single value and/or callbacks. This class is a wrapper of roslibpy Topic instance (https://roslibpy.readthedocs.io/en/latest/reference/index.html#topics)
fr: Représente une instance Topic ROS. Elle supporte à la fois les requêtes pour une simple valeur et/ou pour une fonction de rappel. Cette classe est un wrapper de l'instance Topic roslibpy (https://roslibpy.readthedocs.io/en/latest/reference/index.html#topics)

source: Parameters
fr: Paramètres

source: Instance of the ROS connection.
fr: Instance le la connection à ROS.

source: Topic name.
fr: Nom du topic.

source: Topic type.
fr: Type du topic.

source: convert the response of the topic in a specific type.
fr: Convertir la réponse du topic dans type spécifique.

source: Timeout while waiting a message.
fr: Expiration du délais d'attente d'un message

source: Return the topic connection status.
fr: Retourne le status du topic de connexion

source: Returns
fr: Retourne

source: True if already subscribed, False otherwise.
fr: Vrai si déjà abonné, Faux sinon

source: Return type
fr: Type de retour

source: Publish a message on the topic
fr: Publie un message sur un topic

source: jsonified topic message content
fr: jsonifie le contenu d'un message de topic

source: Subscribe a callback to the topic. A TopicException will be thrown if the topic is already subscribed.
fr: Abonne une fonction de retour au topic. Une TopicException est activée si le topic est déjà connecté

source: The callback function which is called at each incoming topic message.
fr: La fonction de retour appelée à chaque nouvelle arrivée d'un message de topic

source: Unsubscribe to the topic.
fr: Désabonne du topic

source: Return the last value of the topic.
fr: Retourne la valeur du topic

source: The last value of the topic. The value depends on the conversion function of the topic. By default, it will be a dict.
fr: la dernière valeur du topic. La valeur dépend de la fonction de conversion du topic. Par défaut, ce sera un dictionnaire

source: Here is a simple example of using the class without conversion: ::
fr: Ceci est un exemple simple d'utilisation de la classe sans conversion: ::

source: Here is a simple example of using the class with conversion: ::
fr: Ceci est un exemple simple d'utilisation de la classe avec conversion: ::

source: Here is a simple example of using the class with a callback: ::
fr: Ceci est un exemple simple d'utilisation de la classe avec une fonction de retour: ::

source: NiryoTopic - Class
fr: NiryoTopic - Classe
