Repository: NiryoRobotics/pyniryo2
Catalog: docs/locale/*/LC_MESSAGES/source/api_doc/niryo_ros.po
Languages: fr

source: The NiryoRos class inherits the attributes and functions of roslibpy.Ros. It allows the connection of the program to the ROS Master of the robot via roslibpy. It adds an overlay to manage the versions of the robot and a recognition of the API by the robot which is necessary for the use of certain functions.
fr: La classe NiryoRos hérite des attributs et des fonctions de roslibpy.Ros. Il permet la connexion du programme au ROS Master du robot via roslibpy. Il ajoute une surcouche pour gérer les versions du robot et une reconnaissance de l'API par le robot nécessaire à l'utilisation de certaines fonctions.

source: Connect to your computer to ros: ::
fr: Connectez votre ordinateur à ros : ::

source: Based on the roslibpy ROS client: https://roslibpy.readthedocs.io/en/latest/reference/index.html#roslibpy.Ros
fr: Basé sur le client ROS roslibpy : https://roslibpy.readthedocs.io/en/latest/reference/index.html#roslibpy.Ros

source: Parameters
fr: Paramètres

source: ip of the ros master
fr: ip du ROS Master

source: usually 9090
fr: généralement 9090

source: Disconnect from ROS.
fr: Déconnection à ROS.

source: Signals the termination of the main event loop.
fr: Signale la fin de la boucle d'événements principale.

source: Get the hardware version of the robot (one, ned, ned2)
fr: Obtenir la version matérielle du robot (one, ned, ned2)

source: Returns
fr: Retour

source: The hardware version of the robot (one, ned, ned2)
fr: La version matérielle du robot (one, ned, ned2)

source: Return type
fr: Type de retour
