Repository: NiryoRobotics/pyniryo2
Catalog: docs/locale/*/LC_MESSAGES/source/api_doc/niryo_robot.po
Languages: fr

source: The NiryoRobot class includes the different APIs of the PyNiryo2 library. It allows the connection of the program to the robot via roslibpy. This interface facilitates and centralizes all the control functions of the Niryo environment and products.
fr: La classe NiryoRobot inclut les différentes APIs de la librairie PyNiryo2. Elle permet la connexion entre le programme et le robot en utilisant roslibpy. Cette interface facilite et centralise toutes les fonctions de contrôle de l'environnement Niryo et de ses produits.

source: NiryoRobot - Command functions
fr: NiryoRobot - Fonctions de contrôle

source: This section reference all existing functions of the NiryoRobot client, which include
fr: Cette section répertorie toutes les fonctions existantes du client du NiryoRobot

source: Connecting to your Ned
fr: Se connecte à votre Ned

source: Disconnecting from your Ned
fr: Se déconnecte de votre Ned

source: Waiting
fr: Attente

source: Access to the entire PyNiryo2 API
fr: Accès à l'API PyNiryo2 entière

source: All functions to control the robot are accessible via an instance of the class :ref:`source/api_doc/niryo_robot:NiryoRobot` ::
fr: Toutes les fonctions pour contrôler le robot sont accessibles grâce à une instance de la classe :ref:`source/api_doc/niryo_robot:NiryoRobot` ::

source: See examples on :ref:`Examples Section <source/examples/examples_basics:Examples: Basics>`
fr: Voir des exemples dans la :ref:`Section Exemples <source/examples/examples_basics:Examples: Basics>`

source: List of functions subsections:
fr: Liste des fonctions de sous-sections

source: NiryoRobot functions
fr: Fonctions du NiryoRobot

source: Connect your robot to your computer: ::
fr: Connecte votre robot à votre ordinateur: ::

source: Parameters
fr: Paramètres

source: robot ROS ip
fr: IP du ROS du robot

source: robot ROS port
fr: Port du ROS du robot

source: Get the Niryo Ros client
fr: Obtenir le client NiryoRos

source: Returns
fr: Renvoie

source: NiryoRos client
fr: Client NiryoRos

source: Return type
fr: Type de retour

source: Disconnect from your robot and ROS: ::
fr: Se déconnecte du robot et de ROS

source: Wait for a certain time
fr: Attend un certain temps

source: duration in seconds
fr: durée en secondes

source: NiryoRobot properties
fr: Propriétés du NiryoRobot

source: Access to the Arm API
fr: Accède à l'API du Bras

source: Example: ::
fr: Exemple: ::

source: Access to the Conveyor API
fr: Accède à l'API du Convoyeur

source: Access to the I/Os API
fr: Accède à l'API des I/Os

source: Access to the PickPlace API
fr: Accède à l'API de Pick&Place

source: Access to the SavedPoses API
fr: Accède à l'API des SavedPoses

source: Access to the Sound API
fr: Accède à l'API du son

source: Access to the Tool API
fr: Accède à l'API de l'Outil

source: Access to the Trajectories API
fr: Accède à l'API des Trajectoires

source: Access to the Vision API
fr: Accède à l'API de Vision

source: Access to the Led Ring API
fr: Accède à l'API de l'anneau LED

source: Access to the frame API
fr: Accède à l'API du Bras

source: Globals Enums
fr: Enumerations Gloables

source: List of enums:
fr: Liste des enumerations

source: An enumeration.
fr: Une enumeration

source: Enumeration of Arm Move Command : it used for move commands
fr: Enumeration de l'Arm Move Command : utilisé pour les contrôles de déplacement du bras

source: Globals Objects
fr: Objets Globaux

source: Pose object which stores x, y, z, roll, pitch & yaw parameters
fr: Objet Pose qui sauvegarde la paramètres x, y, z, roll, pitch & yaw

source: Variables
fr: Attributs

source: X (meter)
fr: X (mètres)

source: Y (meter)
fr: Y (mètres)

source: Z (meter)
fr: Z (mètres)

source: Roll (radian)
fr: Roulis (randian)

source: Pitch (radian)
fr: Tangage (radian)

source: Yaw (radian)
fr: Lacet (radian)

source: Create a new pose from copying from copying actual pose with offsets
fr: Créé une nouvelle position en copiant la position actuelle avec les offsets

source: Return a list [x, y, z, roll, pitch, yaw] corresponding to the pose's parameters
fr: Retourne une liste [x, y, z, roll, pitch, yaw] correspondant aux paramètres de la position

source: Return the quaternion in a list [qx, qy, qz, qw]
fr: Retourne le quaternion sous forme de liste [qx, qy, qz, qw]

source: Return the position and the quaternion in a list [x, y, z, qx, qy, qz, qw]
fr: Retourne la positions et le quaternion dans une liste [x, y, z, qx, qy, qz, qw]

source: Convert euler angles to quaternion
fr: Convertir les angles d'euler en quaternion

source: roll in radians
fr: roulis en radians

source: pitch in radians
fr: tagage en radians

source: yaw in radians
fr: lacet en radians

source: quaternion in a list [qx, qy, qz, qw]
fr: quaternion dans une liste [qx, qy qz, qw]

source: euler angles in a list [roll, pitch, yaw]
fr: angles d'euler dans une liste [roulis, tangage, lacet]
