Repository: NiryoRobotics/pyniryo2
Catalog: docs/locale/*/LC_MESSAGES/source/api_doc/pick_place.po
Languages: fr

source: This file presents the different :ref:`source/api_doc/pick_place:Pick & Place - Command functions` available with the Pick & Place API
fr: Ce fichier présente les différentes :ref:`fonctions de commande <source/api_doc/pick_place:Pick & Place - Command functions>` disponible avec l'API du Pick & Place

source: Pick & Place - Command functions
fr: Pick & Place - Fonctions de contrôle

source: This section reference all existing functions to control your robot, which include
fr: Cette section répertorie toutes les fonctions de contrôle du robot, ce qui inclut

source: Picking objects
fr: Saisie d'objets

source: Placing objects
fr: Dépôt d'objets

source: All functions to control the robot are accessible via an instance of the class :ref:`source/api_doc/niryo_robot:NiryoRobot` ::
fr: Toutes les fonctions de contrôle du robot sont accessibles grâce à une instance de class :ref:`source/api_doc/niryo_robot:NiryoRobot` ::

source: See examples on :ref:`Examples Section <source/examples/examples_vision:Examples: Vision>`
fr: Voir les exemples sur :ref:`Examples Section <source/examples/examples_vision:Examples: Vision>`

source: List of functions subsections:
fr: Liste des fonctions de sous-sections

source: Pick & Place functions
fr: Fonctions de Pick & Place

source: Execute a picking from a pose.
fr: Réalise une saisie à partir d'une position

source: A picking is described as :
fr: Une saisie est décrit comme :

source: * going over the object
fr: * va au dessus de l'objet

source: * going down until height = z
fr: * descend jusqu'à ce que la hauteur = z

source: * grasping with tool
fr: * saisie avec le préhenseur

source: * going back over the object
fr: * retourne au dessus de l'objet

source: Parameters
fr: Paramètres

source: either 6 args (1 for each coordinates) or a list of 6 coordinates or a PoseObject
fr: Soit 6 arguments (1 pour chaque coordonnées) ou une liste de 6 coordonnées ou un PoseObject

source: Return type
fr: Type de retour

source: Execute a placing from a position.
fr: Réalise un dépôt à partir d'une position

source: A placing is described as :
fr: Un dépôt est décrit comme :

source: * going over the place
fr: * va au dessus de l'emplacement

source: * releasing the object with tool
fr: * relâche l'objet avec l'outil

source: * going back over the place
fr: * retourne au dessus de l'emplacement

source: Execute a pick then a place
fr: Réalise le pick, ensuite le place

source: Pick Pose : [x, y, z, roll, pitch, yaw] or PoseObject
fr: Position de Pick : [x, y, z, roll, pitch, yaw] ou PoseObject

source: Place Pose : [x, y, z, roll, pitch, yaw] or PoseObject
fr: Distance entre les points de passage avant le lissage de la trajectoire
