Repository: NiryoRobotics/pyniryo2
Catalog: docs/locale/*/LC_MESSAGES/source/api_doc/saved_poses.po
Languages: fr

source: Saved poses
fr: Positions sauvegardées

source: This file presents the different :ref:`source/api_doc/saved_poses:Saved poses - Command functions`, available with the Saved poses API
fr: Ce fichier présente les différentes :ref:`fonctions de commande <source/api_doc/saved_poses:Saved poses - Command functions>`, disponibles avec l'API des positions sauvegardées

source: Saved poses - Command functions
fr: Positions sauvegardées - Fonctions de contrôle

source: This section reference all existing functions to control your robot, which include
fr: Cette section fait référence au fonctions de contrôle du robot existantes, ce qui inclut

source: Management of saved poses
fr: Gestion des positions sauvegardées

source: All functions to control the robot are accessible via an instance of the class :ref:`source/api_doc/niryo_robot:NiryoRobot` ::
fr: Toutes les fonctions de contrôle du robot sont accessibles grâce à une instance class :ref:`source/api_doc/niryo_robot:NiryoRobot` ::

source: See examples on :ref:`Examples Section <source/examples/examples_conveyor:Examples: Conveyor>`
fr: Voir les exemples sur :ref:`Examples Section <source/examples/examples_conveyor:Examples: Conveyor>`

source: List of functions subsections:
fr: Liste de fonctions de sous-sections

source: Saved poses functions
fr: Fonctions des positions sauvegardées

source: Get pose saved in from Ned's memory
fr: Obtient la position sauvegardée dans la mémoire du Ned

source: Examples: ::
fr: Exemples: ::

source: Parameters
fr: Paramètres

source: Pose name in robot's memory
fr: Nom de la position dans la mémoire du robot

source: Returns
fr: Retourne

source: Pose associated to pose_name
fr: Position associé à pose_name

source: Return type
fr: Type de retour

source: Save pose (x, y, z, roll, pitch, yaw) in robot's memory
fr: Position sauvegardée (x, y, z, roll, pitch, yaw) dans la mémoire du robot

source: either 6 args (1 for each coordinates) or a list of 6 coordinates or a PoseObject
fr: Soit 6 arguments (1 pour chaque coordonnées) ou une liste de 6 coordonnées ou un PoseObject

source: Delete pose from robot's memory
fr: Supprime la position de la mémoire du robot

source: Get list of poses' name saved in robot memory
fr: Obtient la liste des noms de positions sauvegardés dans la mémoire du robot
