Repository: NiryoRobotics/pyniryo2
Catalog: docs/locale/*/LC_MESSAGES/source/api_doc/sound.po
Languages: fr

source: Sound
fr: Son

source: This file presents the different :ref:`functions <source/api_doc/sound:Sound - Command functions>`, :ref:`enums <source/api_doc/sound:Sound - Enums>` and :ref:`topics <source/api_doc/sound:Sound - Niryo Topics>` available with the Sound API
fr: Ce fichier présente les différentes :ref:`fonctions <source/api_doc/sound:Sound - Command functions>`, :ref:`enums <source/api_doc/sound:Sound - Enums>` et :ref:`topics <source/api_doc/sound:Sound - Niryo Topics>` disponible avec l'API Son

source: Sound - Command functions
fr: Son - Fonctions de commande

source: This section reference all existing functions to control the Sound interface of the Ned2. All functions are accessible via an instance of the class :ref:`NiryoRobot <source/api_doc/niryo_robot:NiryoRobot>` ::
fr: Cette section fait référence à toutes les fonctions existantes pour contrôler l'interface audio du Ned2. Toutes les fonctions sont accessibles via une instance de la classe :ref:`NiryoRobot<source/api_doc/niryo_robot:NiryoRobot>` ::

source: List of functions:
fr: Liste des fonctions :

source: Sound robot functions
fr: Fonctions du son du robot

source: Example: ::
fr: Exemple: ::

source: Parameters
fr: Paramètres

source: Niryo ROS client
fr: Client Niryo ROS

source: Sound - Play
fr: Son - Lecture

source: Play a sound that as already been imported by the user on the robot.
fr: Jouer un son qui a déjà été importé par l'utilisateur sur le robot.

source: sound_name: Name of the sound that will be played
fr: sound_name : Nom du son qui sera joué

source: wait for the end of the sound before exiting the function
fr: attendre la fin du son avant de quitter la fonction

source: start the sound from this value in seconds
fr: démarrer le son à partir de cette valeur en secondes

source: end the sound at this value in seconds
fr: terminer le son à cette valeur en secondes

source: Return type
fr: Type de retour

source: Stop a sound being played. It will get automatically the name of the sound being played and stop it.
fr: Arrêter un son en cours de lecture. Il obtiendra automatiquementle nom du son en cours de lecture et l'arrêtera.

source: Returns the sound state client which can be used synchronously or asynchronously to obtain the current played sound.
fr: Renvoie le client d'état du son qui peut être utilisé de manièresynchrone ou asynchrone pour obtenir le son en cours de lecture.

source: Examples: ::
fr: Exemples: ::

source: Returns
fr: Retour

source: sound state topic instance
fr: instance du topic sound state

source: Use gtts (Google Text To Speech) to interpret a string as sound
fr: Utiliser gtts (Google Text To Speech) pour interpréter le textecomme un son

source: Languages available are: ::
fr: Les langues disponibles sont : ::

source: Example ::
fr: Exemple ::

source: Text that needs to be spoken < 100 char
fr: Texte à prononcer < 100 caractères

source: language of the text
fr: langue du texte

source: Sound - Volume
fr: Son - Volume

source: Returns the volume state client which can be used synchronously or asynchronously to obtain the current volume.
fr: Renvoie le client d'état du volume qui peut être utilisé de manière synchrone ou asynchrone pour obtenir le volume actuel.

source: volume topic instance
fr: instance du topic de volume

source: Returns the volume of the robot. The sound can be set between 0 (sound off) and 100 (sound max)
fr: Renvoie le volume du robot. Le son peut être réglé entre 0 (son désactivé) et 100 (son max)

source: int8 corresponding to the volume (0: sound off, 100: sound max)
fr: int8 correspondant au volume (0 : son désactivé, 100 : son max)

source: Set the volume of the robot. You can set it between 0 and 100 (0: sound off and 100: sound max). If you put less than 0, the volume will be set to 0. If you put more than 100, the volume will be set to 100.
fr: Réglez le volume du robot. Vous pouvez le régler entre 0 et 100 (0 : son désactivé et 100 : son max). Si vous mettez moins de 0, le volume sera réglé sur 0. Si vous mettez plus de 100, le volume sera réglé sur 100.

source: Between O and 100 (0 sound off and 100 sound maximum)
fr: Entre O et 100 (0 son désactivé et 100 son maximum)

source: Sound - Manage
fr: Son - Gérer

source: Returns the list of available sounds in the robot
fr: Retourne la liste des sons disponibles dans le robot

source: Import a sound on the RaspberryPi of the robot. To do that, you will need the encoded data from a wav or mp3 sound. It is preferable to put the encoded data from the sound on a text file and directly read it from this file. You also need to give the name of the sound you want to import.
fr: Importer un son sur le RaspberryPi du robot. Pour ce faire, vous aurez besoin des données encodées d'un son wav ou mp3. Il est préférable de mettre les données encodées du son sur un fichier texte et de les lire directement depuis ce fichier. Vous devez également donner le nom du son que vous souhaitez importer.

source: For example, test.wav. Il will be the name of the sound in the robot
fr: Par exemple, test.wav. Ce sera le nom du son dans le robot

source: absolute path to the sound file
fr: chemin absolu vers le fichier son

source: Delete a sound imported on the robot
fr: Supprimer un son importé sur le robot

source: For example, test.wav
fr: Par exemple, test.wav

source: Get the duration of a sound in seconds
fr: Obtenir la durée d'un son en secondes

source: Returns the duration of a sound in seconds
fr: Renvoie la durée d'un son en secondes

source: Sound - Niryo Topics
fr: Son - Niryo Topics

source: The use of these functions is explained in the :ref:`NiryoTopics <source/api_doc/niryo_topics:NiryoTopic>`, section. They allow the acquisition of data in real time by callbacks or by direct call.
fr: L'utilisation de ces fonctions est expliquée dans la section :ref:`NiryoTopics <source/api_doc/niryo_topics:NiryoTopic>`. Ils permettent l'acquisition de données en temps réel par callbacks ou par appel direct.

source: Sound's Niryo Topics
fr: Topics Niryo du son

source: Name
fr: Nom

source: Function
fr: Fonction

source: Sound - Enums
fr: Son - Énumérations

source: List of enums:
fr: Liste des énumérations :

source: Enumeration of the actions of sound database management
fr: Enumération des actions de bonne gestion de la base de données

source: Enumeration of the Text To Speech languages
fr: Énumération des langues Text To Speech
