Repository: NiryoRobotics/pyniryo2
Catalog: docs/locale/*/LC_MESSAGES/source/api_doc/tool.po
Languages: fr

source: Tool
fr: Outil

source: This file presents the different :ref:`source/api_doc/tool:Tool - Command functions`, :ref:`source/api_doc/tool:Tool - Enums` & :ref:`source/api_doc/tool:Tool - Niryo Topics` available with the Tool API
fr: Ce fichier présente les différentes :ref:`source/api_doc/tool:Tool - Command functions`, :ref:`source/api_doc/tool:Tool - Enums` & :ref:`source/api_doc/tool:Tool - Niryo Topics` disponible avec l'outil

source: Tool - Command Functions
fr: Outil - Fonctions de contrôle

source: This section reference all existing functions to control your robot, which include
fr: Cette section fait référence à toutes les fonctions de contrôle du robot existante, ce qui inclut

source: Using tools
fr: Utilise les outils

source: Using grippers
fr: Utilise les préhenseurs

source: Using the vacuum pump
fr: Utilise la pompe à vide

source: Using the electromagnet
fr: Utilise l'électroaimant

source: Management of the TCP
fr: Gestion du PCO

source: All functions to control the robot are accessible via an instance of the class :ref:`source/api_doc/niryo_robot:NiryoRobot` ::
fr: Toutes les fonctions de contrôle du robot sont accessibles grâce à une instance class :ref:`source/api_doc/niryo_robot:NiryoRobot` ::

source: See examples on :ref:`Examples Section <source/examples/examples_tool_action:Examples: Tool Action>`
fr: Voir des exemples sur :ref:`Examples Section <source/examples/examples_tool_action:Examples: Tool Action>`

source: List of functions subsections:
fr: Liste des fonctions de sous-sections

source: Tool robot functions
fr: Fonctions des outils

source: Example: ::
fr: Exemple: ::

source: Parameters
fr: Paramètres

source: Niryo ROS client
fr: Client Niryo ROS

source: Tool functions
fr: Fonctions des outils

source: Update equipped tool
fr: Mise à jour de l'outil équipé

source: Examples: ::
fr: Exemple: ::

source: Callback invoked on successful execution.
fr: Fonction de retour appelé en cas de réussite lors de l'exécution

source: Callback invoked on error.
fr: Fonction de retour appelé en cas d'erreur lors de l'exécution

source: Timeout for the operation, in seconds. Only used if blocking.
fr: Délai d'exécution de l'opération, en secondes. Utilisé seulement en cas de blocage

source: Return type
fr: Type du retour

source: Returns
fr: Retourne

source: The equipped tool ID
fr: Identifiant de l'outil équipé

source: Returns the equipped tool Id client which can be used synchronously or asynchronously to obtain the equipped tool Id. The topic returns a attribute of the ToolID enum.
fr: Retourne le client de l'identifiant de l'outil équipé qui peut être utilisé de manière synchrone ou asynchrone pour récupérer l'identifiant de l'outil équipé.Le topic retourne un attribut du ToolID enum

source: the equipped tool Id topic instance.
fr: Instance du topic de l'identifiant de l'outil

source: Grasp with tool This action correspond to * Close gripper for Grippers * Pull Air for Vacuum pump * Activate for Electromagnet If a callback function is not passed in parameter, the function will be blocking. Otherwise, the callback will be called when the execution of the function is finished.
fr: Saisie avec outil. Cette action correspond à - Ferme le préhenseur pour Préhenseurs - Aspire l'air pour la pompe à vide - Active l'électroaimant si une fonction de retour n'est pas passé en paramètre, la fonction sera bloquée. Sinon, la fonction de retour sera appelé quand l'exécuton de la fonction est finie.

source: Release with tool This action correspond to * Open gripper for Grippers * Push Air for Vacuum pump * Deactivate for Electromagnet If a callback function is not passed in parameter, the function will be blocking. Otherwise, the callback will be called when the execution of the function is finished.
fr: Saisie avec outil. Cette action correspond à - Ferme le préhenseur pour Préhenseurs - Aspire l'air pour la pompe à vide - Active l'électroaimant si une fonction de retour n'est pas passé en paramètre, la fonction sera bloquée. Sinon, la fonction de retour sera appelé quand l'exécuton de la fonction est finie.

source: Grippers functions
fr: Fonctions des Préhenseurs

source: Open gripper associated to the equipped gripper. If a callback function is not passed in parameter, the function will be blocking. Otherwise, the callback will be called when the execution of the function is finished.
fr: Ouvre le préhenseur associé au préhenseur équipé avec une vitesse 'vitesse'. Si une fonction de retour n'est pas passé en paramètre, la fonction sera bloquée. Sinon, la fonction de retour sera appelé quand l'exécuton de la fonction est finie.

source: Between 100 & 1000 (only for Niryo One and Ned1)
fr: Entre 100 et 1000 (uniquement pour le Niryo one et le Ned 1)

source: Closing torque percentage (only for Ned2)
fr: Pourcentage de couple de fermeture (uniquement pour le Ned2)

source: Hold torque percentage after closing (only for Ned2)
fr: Pourcentage de couple de maintient après fermeture (uniquement pour le Ned2)

source: Close gripper associated to 'gripper_id' with a speed 'speed' If a callback function is not passed in parameter, the function will be blocking. Otherwise, the callback will be called when the execution of the function is finished.
fr: Ferme le préhenseur associé au 'gripper_id' à la vitesse 'vitesse'. Si une fonction de retour n'est pas passé en paramètre, la fonction sera bloquée. Sinon, la fonction de retour sera appelé quand l'exécuton de la fonction est finie.

source: Opening torque percentage (only for Ned2)
fr: Pourcentage de couple d'ouverture (uniquement pour le Ned2)

source: Hold torque percentage after opening (only for Ned2)
fr: Pourcentage de couple de maintient après ouverture (uniquement pour le Ned2)

source: Vacuum pump functions
fr: Fonctions de la Pompe à vide

source: Pull air of vacuum pump If a callback function is not passed in parameter, the function will be blocking. Otherwise, the callback will be called when the execution of the function is finished.
fr: Aspire l'air de la pompe à vide. Si une fonction de retour n'est pas passé en paramètre, la fonction sera bloquée. Sinon, la fonction de retour sera appelé quand l'exécuton de la fonction est finie.

source: Push air of vacuum pump If a callback function is not passed in parameter, the function will be blocking. Otherwise, the callback will be called when the execution of the function is finished.
fr: Relâche l'air de la pompe à vide. Si une fonction de retour n'est pas passé en paramètre, la fonction sera bloquée. Sinon, la fonction de retour sera appelé quand l'exécuton de la fonction est finie.

source: Electromagnet functions
fr: Fonctions de l'électroaimant

source: Setup electromagnet on pin
fr: Installe l'électroaimant sur une broche

source: Activate electromagnet associated to electromagnet_id on pin_id If a callback function is not passed in parameter, the function will be blocking. Otherwise, the callback will be called when the execution of the function is finished.
fr: Active l'électroaimant associé à electromagnet_id sur le pin_id. Si une fonction de retour n'est pas passé en paramètre, la fonction sera bloquée. Sinon, la fonction de retour sera appelé quand l'exécuton de la fonction est finie.

source: Deactivate electromagnet associated to electromagnet_id on pin_id If a callback function is not passed in parameter, the function will be blocking. Otherwise, the callback will be called when the execution of the function is finished.
fr: Désactive l'électroaimant associé à electromagnet_id sur le pin_id. Si une fonction de retour n'est pas passé en paramètre, la fonction sera bloquée. Sinon, la fonction de retour sera appelé quand l'exécuton de la fonction est finie.

source: TCP functions
fr: Fonctions du PCO

source: Enables or disables the TCP function (Tool Center Point). If activation is requested, the last recorded TCP value will be applied. The default value depends on the gripper equipped. If deactivation is requested, the TCP will be coincident with the tool_link.
fr: Active ou désactive la fonction PCO (Point Central de l'Outil). Si une activation est demandée, la dernière valeur pour le PCO va être appliquée. Par défaut la valeur dépend du préhenseur équipé. Si la désactivation est demandée, le PCO va coincider avec le repère 'tool_link'.

source: True to enable, False otherwise.
fr: True pour activer, False pour désactiver.

source: Activates the TCP function (Tool Center Point) and defines the transformation between the tool_link frame and the TCP frame.
fr: Active la fonction de PCO (Point Central de l'Outil) et définit la transformation entre le repère 'tool_link' et le repère du PCO.

source: either 6 args (1 for each coordinates) or a list of 6 coordinates or a ``PoseObject``
fr: Soit 6 arguments (1 pour chaque coordonnées) ou une liste de 6 coordonnées ou un ``PoseObject``

source: Reset the TCP (Tool Center Point) transformation. The PCO will be reset according to the tool equipped.
fr: Réinitialise la transformation appliquée au PCO (Point Central de l'Outil). La valeur par défaut dépend de l'outil actuellement équipé.

source: Tool - Niryo Topics
fr: Outil - Topics Niryo

source: The use of these functions is explained in the :ref:`source/api_doc/niryo_topics:NiryoTopic` section. They allow the acquisition of data in real time by callbacks or by direct call.
fr: L'utilisation de ces fonctions est expliqué dans la section :ref:`source/api_doc/niryo_topics:NiryoTopic`. Elles permettent l'acquisition de données en temps réel par des fonctions de rappel ou des appels directs

source: Tool's Niryo Topics
fr: Topics Niryo pour les Outils

source: Name
fr: Nom

source: Function
fr: Fonction

source: Tool - Enums
fr: Outil - Enumerations

source: List of enums:
fr: Liste des enumerations

source: Enumeration of Tools IDs
fr: Enumeration des identifiants des Outils

source: An enumeration.
fr: Une enumeration
