Repository: NiryoRobotics/pyniryo2
Catalog: docs/locale/*/LC_MESSAGES/source/api_doc/trajectories.po
Languages: fr

source: Trajectories
fr: Trajectoires

source: This file presents the different :ref:`source/api_doc/trajectories:Trajectories - Command functions` available with the Trajectories API
fr: Ce fichier présente les différentes :ref:`source/api_doc/trajectories:Trajectories - Command functions` disponibles avec l'API des Trajectoires

source: Trajectories - Command functions
fr: Trajectoires - Fonctions de Commande

source: This section reference all existing functions to control your robot, which include
fr: Cette section fait référence à toutes les fonctions de contrôle du robot existante, ce qui inclut:

source: Playing smoothed waypointed trajectories
fr: Effectuer une trajectoire par points d'intérêts lissée

source: Managing saved trajectories
fr: Gère les trajectoires sauvegardées

source: All functions to control the robot are accessible via an instance of the class :ref:`source/api_doc/niryo_robot:NiryoRobot` ::
fr: Toutes les fonctions pour contrôler le robot sont accessibles grâce à une instance de la classe :ref:`source/api_doc/niryo_robot:NiryoRobot` ::

source: See examples on :ref:`Examples Section <source/examples/examples_movement:Examples: Movement>`
fr: Voir des exemples dans la section :ref:`Section Exemples <source/examples/examples_movement:Examples: Movement>`

source: List of functions subsections:
fr: Liste des fonctions de sous-sections

source: Trajectories functions
fr: Fonctions de Trajectoires

source: Get saved trajectory from robot intern storage Will raise error if position does not exist
fr: Obtient la trajectoire sauvegardée dans la mémoire interne du robot. Génère une erreur si la trajectoire n'existe pas

source: Example: ::
fr: Exemple: ::

source: Parameters
fr: Paramètres

source: name of the trajectory
fr: nom de la trajectoire

source: Raises
fr: Appelle

source: If trajectory file doesn't exist
fr: Si le fichier de trajectoire n'existe pas.

source: Returns
fr: Retourne

source: list of [j1, j2, j3, j4, j5, j6] in rad
fr: list de [j1, j2, j3, j4, j5, j6] en radians

source: Return type
fr: Type de retour

source: Execute trajectory from Ned's memory If a callback function is not passed in parameter, the function will be blocking. Otherwise, the callback will be called when the execution of the function is finished.
fr: Execute une trajectoire depuis la mémoire du Ned. Si une fonction de rappel n'est pas donnée en paramètre, cette fonction sera bloquante. Sinon, la fonction de rappel sera appelé quand l'exécution de la fonction est terminée.

source: Examples: ::
fr: Exemples: ::

source: Callback invoked on successful execution.
fr: Fonction de rappel lancée en cas de réussite lors de l'exécutio

source: Execute trajectory from list of poses If a callback function is not passed in parameter, the function will be blocking. Otherwise, the callback will be called when the execution of the function is finished.
fr: Réalise la trajectory à partir d'une liste de positions. Si une fonction de rappel n'est pas passée en paramètre, cette fonction sera bloquante. Sinon la fonction de rappel sera appelé une fois l'exécution de la fonction terminée.

source: List of: [x,y,z,qx,qy,qz,qw] or [x,y,z,roll,pitch,yaw] or PoseObject
fr: Liste de: [x,y,z,qx,qy,qz,qw] ou [x,y,z,roll,pitch,yaw] ou PoseObject

source: Distance from waypoints before smoothing trajectory
fr: Distance de lissage de la trajectoire des points d epassage

source: Save trajectory in robot's memory
fr: Sauvegarde la trajectoire dans la mémoire du robot

source: list of joints positions the robot needs to pass by in the trajectory
fr: liste des positions des articulations par lesquelles le robotdoit passer dans la trajectoire

source: name you give trajectory in the robot's memory
fr: nom que vous donnez trajectoire dans la mémoire du robot

source: description you give trajectory in the robot's memory
fr: description que vous donnez trajectoire dans la mémoire du robot

source: Save last executed trajectory in robot's memory
fr: Sauvegarde la dernière trajectoire apprise, dans la mémoire du robot

source: Delete trajectory from robot's memory
fr: Supprime la trajectoire de la mémoire du robot

source: Delete all trajectories from robot's memory
fr: Supprime toutes les trajectoires de la mémoire du robot

source: Get list of trajectories' name saved in robot memory
fr: Obtient la liste des noms des trajectoires présentent dans la mémoire du robot

source: list of tuple(trajectory name, trajectory definition)
fr: liste de tuple (nom de la trajectoire, définition de la trajectoire)

source: Update the trajectory informations: name and description
fr: Mettre à jour les informations de la trajectoire : nom et description

source: name of the trajectory you want to change infos
fr: nom de la trajectoire dont vous souhaitez modifier les infos

source: new name you want to give to the trajectory
fr: nouveau nom que vous voulez donner à la trajectoire

source: new description you want to give to the trajectory
fr: nouvelle description que vous voulez donner à la trajectoire
