Repository: NiryoRobotics/pyniryo2
Catalog: docs/locale/*/LC_MESSAGES/source/api_doc/vision.po
Languages: fr

source: This file presents the different :ref:`source/api_doc/vision:Vision - Command functions`, :ref:`source/api_doc/vision:Vision - Enums`, :ref:`source/api_doc/vision:Vision - Niryo Topics` & :ref:`source/api_doc/vision:Vision - NamedTuple` available with the Vision API
fr: Ce fichier présente les différentes :ref:`source/api_doc/vision:Vision - Command functions`, :ref:`source/api_doc/vision:Vision - Enums`, :ref:`source/api_doc/vision:Vision - Niryo Topics` & :ref:`source/api_doc/vision:Vision - NamedTuple` disponible avec l'API de Vision

source: Vision - Command functions
fr: Vision - Fonctions de contrôle

source: This section reference all existing functions to control your robot arm, which include
fr: Cette section fait référence à toutes les fonctions de contrôle du bras robotique existantes, ce qui inclut

source: Getting camera image
fr: Obtient l'image de la caméra

source: Detecting objects
fr: Détecte les objets

source: Managing workspaces
fr: Gère les workspaces

source: All functions to control the robot are accessible via an instance of the class :ref:`source/api_doc/niryo_robot:NiryoRobot` ::
fr: Toutes les fonctions de contrôle du bras sont accessibles grâce à une instance de classe :ref:`source/api_doc/niryo_robot:NiryoRobot` ::

source: See examples on :ref:`Examples Section <source/examples/examples_vision:Examples: Vision>`
fr: Voir les exemples dans :ref:`Examples Section<source/examples/examples_vision:Examples: Vision>`

source: List of functions subsections:
fr: Liste des fonctions de sous-sections

source: Vision robot functions
fr: Vision - Fonctions de contrôle

source: Example: ::
fr: Exemples: ::

source: Parameters
fr: Paramètres

source: Niryo ROS client
fr: Client Niryo Ros

source: Camera functions
fr: Fonctions de la caméra

source: Get image from video stream in a compressed format. Use ``uncompress_image`` from the vision package to uncompress it
fr: Obtient les images du flux vidéo en format compressé. Utilise ``uncompress_image`` du package vision pour le décompresser

source: Examples: ::
fr: Exemples: ::

source: Returns
fr: Retourne

source: string containing a JPEG compressed image
fr: Chaîne contenant l'image compréssée au format JPEG

source: Return type
fr: Type de la variable de retour

source: Get calibration object: camera intrinsics, distortions coefficients The topic return a namedtuple(intrinsics: list[list[float]], distortion: list[list[float]])
fr: Obtient l'objet de type calibration: Paramètres intrinsèques de la caméra, coefficients de distortion. Le topic retourne un namedtuple(intrinsics: list[list[float]], distortion: list[list[float]])

source: Return the NiryoTopic to get last stream image parameters: Brightness factor, Contrast factor, Saturation factor. The topic return a namedtuple(brightness_factor: float, contrast_factor: float, saturation_factor: float)
fr: Retourne le NiryoTopic pour obtenir les Paramètres de la dernière image du flux vidéo: facteur de luminosité, facteur de contraste, facteur de saturation. Le topic retourne un namedtuple(brightness_factor: float, contrast_factor: float, saturation_factor: float)

source: Brightness factor: How much to adjust the brightness. 0.5 will give a darkened image, 1 will give the original image while 2 will enhance the brightness by a factor of 2.
fr: Facteur de luminosité : comment ajuster la luminosité. 0.5 donnera une image assombrie, 1 donnera l'image originale tandis que 2 augmentera la luminosité par un facteur 2.

source: Contrast factor: A factor of 1 gives original image. Making the factor towards 0 makes the image greyer, while factor>1 increases the contrast of the image.
fr: Facteur de contraste: un facteur 1 donne l'image originale.Plus le multiplicateur se rapproche de 0 et plus l'image deviendra grise, "tandis qu'un facteur > 1 augmentera le contraste de l'image.

source: Saturation factor: 0 will give a black and white image, 1 will give the original image while 2 will enhance the saturation by a factor of 2.
fr: Facteur de saturation: 0 donnera une image en noir et blanc, 1 donnera l'image originale tandis que 2 augmentera la saturation par un facteur 2

source: ImageParameters namedtuple containing the brightness factor, contrast factor and saturation factor.
fr: ImageParameters namedtuple contient le facteur de luminosité, le facteur de contraste et le facteur de saturation

source: Modify image brightness
fr: Modifie la luminosité de l'image

source: How much to adjust the brightness. 0.5 will give a darkened image, 1 will give the original image while 2 will enhance the brightness by a factor of 2.
fr: Comment ajuster la luminosité: 0.5 donnera une image assombrie, 1 l'image d'origine et 2 augmentera la luminosité par un facteur de 2.

source: Modify image contrast
fr: Modifie le contraste de l'image

source: A factor of 1 gives original image. Making the factor towards 0 makes the image greyer, while factor>1 increases the contrast of the image.
fr: Un facteur 1 équivaut à l'image d'origine. Plus le multiplicateur se rapproche de 0 et plus l'image deviendra grise, "tandis qu'un facteur > 1 augmentera le contraste de l'image.

source: Modify image saturation
fr: Modifie la saturation de l'image

source: How much to adjust the saturation. 0 will give a black and white image, 1 will give the original image while 2 will enhance the saturation by a factor of 2.
fr: Comment ajuster la saturation: 0 donnera une image en noir et blanc, 1 équivaut à l'image d'origine, tandis que 2 va augmenter la saturation par un facteur de 2.

source: Detection functions
fr: Fonctions de détection

source: First detects the specified object using the camera and then returns the robot pose in which the object can be picked with the current tool
fr: Commence par détecter l'objet spécifié en utilisant la caméra puis renvoie la position du robot à laquelle l'objet peut être attrapé avec l'outil utilisé.

source: name of the workspace
fr: nom du workspace

source: offset between the workspace and the target height
fr: offset entre le workspace et la hauteur de la cible

source: shape of the target
fr: forme de la cible

source: color of the target
fr: couleur de la cible

source: Picks the specified object from the workspace. This function has multiple phases:
fr: Saisit l'objet spécifié sur le workspace. Cette fonction possède plusieurs phases:

source: 1. detect object using the camera
fr: 1. détecte l'objet en utilisant la caméra

source: 2. prepare the current tool for picking
fr: 2. prepare l'outil utilisé pour la saisie

source: 3. approach the object
fr: 3. approche l'objet

source: 4. move down to the correct picking pose
fr: 4. descend jusqu'à la bonne position de saisie

source: 5. actuate the current tool
fr: 5. actionne l'outil utilisé

source: 6. lift the object
fr: 6. soulève l'objet

source: Example::
fr: Exemple::

source: Same as `get_target_pose_from_cam` but directly moves to this position
fr: Comme `get_target_pose_from_cam` mais se déplace directement à cette position

source: Detect object in workspace and return its pose and characteristics
fr: Détecte un objet dans le workspace et retourne sa position et ses caractéristiques

source: Workspace functions
fr: Fonctions du workspace

source: Given a pose (x_rel, y_rel, yaw_rel) relative to a workspace, this function returns the robot pose in which the current tool will be able to pick an object at this pose.
fr: Pour une pose (x_rel, y_rel, yaw_rel) donnée relative à un workspace, cette fonction retourne la position du robot dans laquelle l'outil actuel sera capable d'attraper un objet.

source: The height_offset argument (in m) defines how high the tool will hover over the workspace. If height_offset = 0, the tool will nearly touch the workspace.
fr: L'argument height_offset (en m) definit à quelle hauteur l'outil va passer au dessus du workspace. Si height_offset = 0, l'outil touchera presque le workspace.

source: x relative pose (between 0 and 1)
fr: position relative de x (entre 0 et 1)

source: y relative pose (between 0 and 1)
fr: position relative de y (entre 0 et 1)

source: Angle in radians
fr: Angle en radians

source: Save workspace by giving the poses of the robot to point its 4 corners with the calibration Tip. Corners should be in the good order. Markers' pose will be deduced from these poses
fr: Sauvegarder le workspace en donnant au robot les 4 positions lui permettant de pointer ses 4 coins avec la pointe de calibration. Les coins doivent être dans le bon ordre. La position de ces marqueurs sera déduite de ces positions.

source: Poses should be either a list [x, y, z, roll, pitch, yaw] or a PoseObject
fr: Les Positions doivent être une liste [x, y, z, roll, pitch, yaw] ou une PoseObject

source: workspace name
fr: nom du workspace

source: Save workspace by giving the points of worskpace's 4 corners. Points are written as [x, y, z] Corners should be in the good order.
fr: Sauvegarde le workspace en donnant les points des quatre coins du workspace. Les points sont écrit sous la forme [x, y, z]. Les coins doivent être donnés dans le bon ordre

source: Delete workspace from robot's memory
fr: Supprime le workspace de la mémoire du robot

source: name of the saved workspace
fr: nom du workspace sauvegardé

source: Get workspace ratio from robot's memory
fr: Obtient le ratio du workspace dans la mémoire du robot

source: Get list of workspaces' name store in robot's memory
fr: Obtient la liste des noms des workspaces sauvegardés dans la mémoire du robot

source: Vision - Niryo Topics
fr: Vision - Topics Niryo

source: The use of these functions is explained in the :ref:`source/api_doc/niryo_topics:NiryoTopic` section. They allow the acquisition of data in real time by callbacks or by direct call.
fr: L'utilisation de ces fonctions est expliqué dans la section :ref:`source/api_doc/niryo_topics:NiryoTopic`. Elle permettent d'obtenir les données en temps réel grâce aux fonctions de rappel ou par appel direct

source: Vision's Niryo Topics
fr: Topics de Vision Niryo

source: Name
fr: Nom

source: Function
fr: Fonctions

source: Vision - Enums
fr: Vision - Enumerations

source: List of enums:
fr: Liste des enumerations

source: Enumeration of Colors available for image processing
fr: Enumeration des couleurs disponibles pour le traitement de l'image

source: Enumeration of Shapes available for image processing
fr: Enumeration des formes disponibles pour le traitement de l'image

source: Enumeration of actions available for workspaces management
fr: Enumeration des actions disponible pour la gestion des workspaces

source: Create new instance of CameraInfo(intrinsics, distortion)
fr: Crée une nouvelle instance de CameraInfo(intrinsics, distortion)

source: Alias for field number 1
fr: Alias pour le champ numéro 1

source: Alias for field number 0
fr: Alias pour le champ numéro 0

source: Create new instance of ImageParameters(brightness_factor, contrast_factor, saturation_factor)
fr: Crée une nouvell instance de ImageParameters(brightness_factor,

source: Alias for field number 2
fr: Alias pour le champ numéro 2
